Namespace:   Autodesk.Revit.UI.Events
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public string DialogId { get; }
  Visual Basic
Public ReadOnly Property DialogId As String
	Get
  Visual C++
public:
property String^ DialogId {
	String^ get ();
}
 See Also
  DialogBoxShowingEventArgs Class
  Autodesk.Revit.UI.Events Namespace